// integration.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include <iostream>
#include "integrator.h"

int main()
{
	//const long double M_PI = 3.14159265358979323846264L;
	rightPatrs rp;
	integrator i(0.0L, 500.0L, 0.001L);
	i.setPrecision(1e-12);
	//i.integrate(rp);
	i.PowerSpector(-2 * M_PI, 2*M_PI, 0.001L);
	/*for (const auto& elem : i.resMatrix) {
		std::cout << "X = "<<elem[0] << " time = " << elem[1] << std::endl;
	}*/
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
